{
    "scrape_timestamp": "2024-10-23T23:50:41.143759",
    "total_articles": 5,
    "articles": [
        {
            "title": "Man and woman carry out terror attack on Turkish aerospace company",
            "link": "https://news.google.com/read/CBMirAFBVV95cUxPV09RUE1XandvbnlJQjRTN2xJcFFBZkVHX0M5enhjZjB5S2lYU2hROHBJRlByUFZ1aVVuZlpqRmc2SGpuQzV5eGpYQURZenJ4N3FBX2ZzbW5NaXNpN2ppLVVKUF9OU2ZjM1NNcXFrXy03d1ZnWnNIcnhEM0Nza0oyT1paakUzQjlVVjFHM0R1NE9aeS0yN1VLTEdObzBaQ0tVdVA2dE5uWGFCeG5s?hl=en-GB&gl=GB&ceid=GB%3Aen",
            "time": "38 minutes ago",
            "source": "Man and woman carry out terror attack on Turkish aerospace company",
            "id": "article_1",
            "content": "Man and woman carry out terror attack on Turkish aerospace company Four dead and 14 injured as rifle-wielding pair opened fire on staff while another assailant detonated a bomb at the building’s entrance Save This feature is available for registered users. Please register or log in to continueRegisterLog in Comment speech bubble icon Share icon Kieran Kelly 23 October 2024 7:01pm BST Related Topics Turkey, Terrorism, Ankara 23 October 2024 7:01pm BST Save This feature is available for registered users. Please register or log in to continueRegisterLog in Comment speech bubble icon X Icon Facebook Icon WhatsApp Icon Four people have been killed after gunmen opened fire at an aerospace company in Turkey Kieran Kelly 23 October 2024 7:01pm BST A man and a woman wielding assault rifles opened fire on staff at the headquarters of a Turkish aerospace company on Wednesday, in an apparent terror attack that left four dead and 14 more injured.CCTV footage showed two attackers shooting at people fleeing in the company car park, while at least one assailant detonated a bomb at the entrance of the Turkish Aerospace Industries (Tusas) HQ in Ankara, local media reported.A gunman dressed in black was filmed jumping over entry turnstiles and firing through automatic doors from inside the building. One of the attackers was a woman, Turkey’s interior minister confirmed, adding that she and another assailant were “neutralised”.Turkish security forces armed with assault rifles were filmed rushing to the scene of the attack.It is not yet clear how many people were involved in the attack and if there are other suspects still at large. Turkey’s interior minister confirmed the female attacker and another assailant were ‘neutralised’ Recep Tayyip Erdoğan, the president of Turkey, confirmed how many people had been killed and injured as he attended the Brics summit in the Russian city of Kazan.“I condemn this heinous terrorist attack and pray to God to have mercy on our martyrs,” Mr Erdoğan said, before thanking Vladimir Putin for his condolences.Earlier reports claimed a huge explosion was followed by gunfire and hostages were taken during a suspected suicide bomb attack. CCTV from the site showed an armed attacker entering the building Ali Yerlikaya, Turkey’s interior minister, said the attack happened outside the Tusas headquarters in the Kahramankazan district of Ankara, Turkey’s capital.“A terrorist attack was carried out against the Turkish Aerospace Industries... Unfortunately, we have martyrs and injured people,” Mr Yerlikaya said in a statement.The Kahramankazan complex is believed to be home to around 15,000 TUSUS employees.Security forces, ambulances and firefighters were dispatched to the site, NTV television reported. Security forces were deployed to the site of the attack Credit: Serdar Ozsoy/Getty A group of attackers reportedly arrived at the entrance to the company in a taxi during a change of security, according to the TV station.Employees at the company were taken to a safe area.Tusas is considered to be one of Turkey’s most important defence and aviation companies.It is known for producing KAAN, the country’s first national combat aircraft, as well as F16 fighter jets and drones.It is not clear who carried out the attack.The last terror attack to be carried out in Turkey took place in January when a man was shot dead by two gunmen inside a Catholic Church in Istanbul. It was claimed by Islamic State. In October 2023, two policemen were injured in an attack in the government district in Ankara.That attack was claimed by Kurdish separatist group the PKK (Kurdistan Workers’ Party), which has waged an insurgency against the Turkish state since 1984 in a conflict that has claimed tens of thousands of lives.Mark Rutte, the head of Nato, said the alliance would stand with Turkey after the attack.“Deeply concerning reports of dead and wounded in Ankara. Nato stands with our ally Turkey. We strongly condemn terrorism in all its forms and are monitoring developments closely,” Mr Rutte said in a post on X, formerly Twitter. Join the conversation Show comments The Telegraph values your comments but kindly requests all posts are on topic, constructive and respectful. Please review our commenting policy. X Icon Facebook Icon WhatsApp Icon The Telegraph values your comments but kindly requests all posts are on topic, constructive and respectful. Please review our commenting policy. Related Topics Turkey, Terrorism, Ankara License this content You need to be a subscriber to join the conversation. Find out more here. Log In Subscribe Advertisement More stories",
            "fetch_timestamp": "2024-10-23T23:50:15.534294"
        },
        {
            "title": "Live: 'Three dead' at Swanage care home after ‘suspected carbon monoxide leak’",
            "link": "https://news.google.com/read/CBMinAFBVV95cUxOQXBleGpIRVdfQ204V3RNbkpSWkdEY1FRQTVrVGVBXzJkdDhneWw4VVEzWkItWjZ5U2pXRGZ6OWNIRUtnWEppRGowdnVnZFRmMzhVOG8yR0FHcmFjV3FpaDhDamVId2FlUHhRSTBuQkl2YTFYZGYzNzc1VTQybGJFR2w3b2NadTIwcTkxekNlV1FmT3BCU1pDUmtQdDg?hl=en-GB&gl=GB&ceid=GB%3Aen",
            "time": "7 hours ago",
            "source": "Live: 'Three dead' at Swanage care home after ‘suspected carbon monoxide leak’",
            "id": "article_2",
            "content": "No content found",
            "fetch_timestamp": "2024-10-23T23:50:21.593681"
        },
        {
            "title": "At least four dead in attack at Turkish aviation company",
            "link": "https://news.google.com/read/CBMiXEFVX3lxTE5rZFNKU3k5NlpfYlQzdzduVnVONUo4MVBBUW1iSUFDclJlV2dVU3I2bTk0eEpUNXF0RVBWUnM2MzdoWWhpYUFIYXpOX0JGd2hWZG1Ramt3Qm5wNzNs0gFiQVVfeXFMTmhXTEZPTHV3bGhNTng4bVl3UWxwMDlwcFZnd1htOTdJTGF1eTFWU01SM3NfYWc1VDZWNUtiUmxjNXdlcXZJMXZXNjRVQW03eGZaLTFOMkdad0NFclZqV1ZJLXc?hl=en-GB&gl=GB&ceid=GB%3Aen",
            "time": "4 hours ago",
            "source": "At least four dead in attack at Turkish aviation company",
            "id": "article_3",
            "content": "Error fetching content: Page.evaluate: Execution context was destroyed, most likely because of a navigation",
            "fetch_timestamp": "2024-10-23T23:50:27.225863"
        },
        {
            "title": "Family of pregnant mum-of-5 killed in fall from tower block leaving newborn baby fighting for life pay...",
            "link": "https://news.google.com/read/CBMinAFBVV95cUxPQWxCNVdRXzJUc2J4LW9Za3ZHT3RjdDVUckN5Z2kwV0o1TER4WHZmeFJnUHJwVmpVRkM5Mnh4eE9ZZzBSQ0J2Y3Z6OFBSSWZyNGpBbjVjRnhDYVpxY2pRaXZJWnZ1bVVSSnpiLVA5dWhrUXZoOFFlbmI5dHhvM0hDR1c0dGFPNEhKTGtLdGkxRUVaYnJzbWIzYzdsLWLSAaIBQVVfeXFMTVFfWVpwaG9CalNyUGdhaDlFaDhxTXpzMkRneGNQUk9fR2RMNFhLc2VXWFJWS2sxaUJ0c28tclBvbmpDeEtTdGdpYkNuWVoyN24tdjFadzMtZXRiakhkSWtJTUxKclU2eWFscVJxbkdOTTZkckowdFJqZ1Z6ampnU1h0dDFHa24yQzdYN2tHN2FHM3lhWERsQ2NwRWY2aHNpYnFR?hl=en-GB&gl=GB&ceid=GB%3Aen",
            "time": "7 hours ago",
            "source": "Family of pregnant mum-of-5 killed in fall from tower block leaving newborn baby fighting for life pay...",
            "id": "article_4",
            "content": "Summer Raemason, News ReporterPublished: Invalid Date, A HEARTBROKEN family have paid tribute to a pregnant mum who died after falling from a tower block - as her newborn baby fights for her life.Emma Atkinson was heavily pregnant when she fell from Shakespeare Towers, in Burmantofts, Leeds, at around 10.25am yesterday.9Emma Atkinson tragically fell to her death from Shakespeare Towers in Leeds yesterday morningCredit: Facebook9Her heartbroken family have paid tributeCredit: Facebook9Emma's baby was delivered in hospital and is receiving critical care9Tributes have been left outside Shakespeare TowersCredit: SWNSThe mum-to-be was tragically pronounced dead at the scene and her baby was delivered in hospital.The newborn, reportedly a girl, is receiving critical care, West Yorkshire Police confirmed.Emma's devastated family have paid agonising tribute to the beloved mum and continue to pray for her baby daughter.Her cousin Sarah shared on Facebook: \"A call I was not expecting this morning has left us in complete shock. Read MoreLEGEND LOST ITV star dies aged 66 as colleagues share emotional tributesCOP BOUNTY Cop cleared of Kaba murder in hiding after gang puts £10k bounty on his head\"Emma, you had the biggest personality and the biggest heart.\"My beautiful cousin, rest peacefully.\"A devastated friend posted: \"Rest in peace, you beautiful lady. I cannot believe I'm actually writing this.\"Always a beautiful soul in and out! I remember some good memories when I used to hang around with your sister.Most read in The SunFAREWELL GEOFFWorld's strongest man and shot put legend Geoff Capes has died aged 75TRAGIC WORDSHeartbreaking last post shared by pregnant mum-of-5 killed in tower block fallAIRPORT PROBEAll flights grounded as cops probe 'suspicious vehicle' at major UK airportHEARTBROKENEmotional Daisy May Cooper breaks down in floods of tears live on Loose Women\"Thinking of your children at home and praying your baby in hospital will be okay.\"Another pal Marc Duffy shared a picture of the two and wrote: \"Rest in peace Emma Acko... you were and still always will be an amazing woman. \"No matter what we always had a proper good laugh and good times together. I'll cherish the memories, sleep tight.\"\"Oh my beautiful childhood friend, this news is just devastating beyond words, you rest easy now and send strength to those beautiful kiddies of yours, we had some laughs em,\" posted a long-time friend Roxy Rooks.Natasha Sparks wrote: \"Absolutely gutted about the news everyone got today. Emma Acko cannot believe you’re gone. \"Was only at the weekend you were celebrating your baby shower and now you’re watching over her and all your babies. \"My darling girl, rest in eternal peace.\"Dylan Jake Connolly shared another touching tribute which read: \"We have memories that will stay with me forever. You was the crazy friend we all needed.\"You was far too good for this life. God only takes the best and he has shown that with you.\"I will miss your crazy self. From us dancing round your living room while I wrap your Christmas presents to us having a cosy girly nights.\"To say I’m devastated would be an understatement. I love you with all my heart. Sleep tight until we meet again.\"Another friend wrote: \"Emma Acko, oh my heart I can’t believe it, I've been in denial all day.\"I am broke, one of the best. I honestly can’t put into words the pain in my heart for you and your kids it’s just devastating.\"\"RIP Emma Acko, a beautiful soul gone far too soon...thinking of your children and family at this sad time...sleep tight sweet girl,\" shared someone else.Police statement in fullA West Yorkshire Police spokesperson said: \"At 10.24am today, police were contacted by the ambulance service who had been called to an incident where a woman had fallen from height at Shakespeare Towers, in Shakespeare Approach, Burmantofts.\"The woman died at the scene as result of her injuries.\"There were no suspicious circumstances and the Coroner’s Office has been informed.\"The woman, aged in her thirties, was in the late stage of pregnancy and her baby was delivered at hospital after the incident and is receiving critical care.\"Cops confirmed there were \"no suspicious circumstances\" in Emma's death.One resident told the BBC he had been in his flat on the 14th floor when he heard a \"thud\" and screaming.He said: \"It's a shock to everybody, to the whole community.\"Labour councillor Luke Farley described the tragedy as \"deeply distressing\". He said: \"I also want to reassure residents that there will be a police presence there over the next day or so.\"A flower bouquet has been left at the scene in memory of the mother-to-be. A West Yorkshire Police spokesperson said: \"At 10.24am today, police were contacted by the ambulance service who had been called to an incident where a woman had fallen from height at.\"The woman died at the scene as result of her injuries.READ MORE SUN STORIESHELPING HAND Hundreds of households to get a direct payment to bank accounts worth £100sHELPING HAND Final date £300 Winter Fuel payment will be made confirmed by DWP\"There were no suspicious circumstances and the Coroner’s Office has been informed.\"The woman, aged in her thirties, was in the late stage of pregnancy and her baby was delivered at hospital after the incident and is receiving critical care.\"9Emotional tributes have poured in from family and friendsCredit: Facebook9Cops confirmed there were 'no suspicious circumstances' in Emma's deathCredit: Facebook9A tribute to Emma from 'Kelly, Dave and kids'Credit: SWNS9Police responded to calls from Shakespeare Towers at around 10.25am9The apartment block has 16 storeysCredit: SWNSTopicsCrimeFacebookNHSPoliceLeedsWest YorkshireYorkshireNEW STORIES ON THE SUNYOU MIGHT LIKE",
            "fetch_timestamp": "2024-10-23T23:50:33.209590"
        },
        {
            "title": "Geoff Capes, Britain’s greatest shot putter and two-time World’s Strongest Man, dies aged 75",
            "link": "https://news.google.com/read/CBMipAFBVV95cUxQbkF4TnY1NWgtU04xT3AwbDViUjU2eWhiOElOaEx1bi1MQkxIZ2hla0tFOTI0VFlTa0VEMGZxZHVXdi0yV1hUdVRjUDRENk8tTDM4ZE5sdkV6Z1ZKWXVIUDRTWTZHd1d1VExBdGNhd1hxZTdUX3J3aDcydHlQbVBkREFtOElha29PS3JBTGM3NUt4WW80TFRpTGJqTzY3aDl0bWZjWQ?hl=en-GB&gl=GB&ceid=GB%3Aen",
            "time": "34 minutes ago",
            "source": "Geoff Capes, Britain’s greatest shot putter and two-time World’s Strongest Man, dies aged 75",
            "id": "article_5",
            "content": "Geoff Capes won the World’s Strongest Man competition twice and competed in three Olympic Games. Photograph: Neville Marriner/Daily Mail/ShutterstockView image in fullscreenGeoff Capes won the World’s Strongest Man competition twice and competed in three Olympic Games. Photograph: Neville Marriner/Daily Mail/ShutterstockAthleticsGeoff Capes, Britain’s greatest shot putter and two-time World’s Strongest Man, dies aged 75Athlete was twice the Commonwealth championWon World’s Strongest Man title in 1983 and 1985Tony PaleyWed 23 Oct 2024 17.35 BSTLast modified on Wed 23 Oct 2024 18.46 BSTShareGeoff Capes, who competed for Great Britain in the shot put at three Olympic Games, won two Commonwealth titles and twice won the World’s Strongest Man competition, has died aged 75.A family statement said: “The family of Geoffrey Capes would like to announce his sad passing today, 23rd October. Britain’s finest shot-putter and twice world’s strongest man.”Capes was at the height of his sporting prowess in the 1970s, competing in the Great Britain team for 11 years, and racking up the largest number of athletics caps in history for his country. He became a household name after his track and field career was over, starring in the hugely popular Superstars TV programme which attracted 10 million viewers at its height and then winning the famous World’s Strongest Man title in 1983 and 1985.View image in fullscreenGeoff Capes in action in 1973. Photograph: Colorsport/ShutterstockCapes was UK shot put champion on three occasions. He claimed gold at the 1984 Commonwealth Games in Christchurch, when he recorded a record throw of 20.74 metres. He then defended the title four years later in Edmonton, Canada.He went on to win gold at the European Indoor Championships in Gothenburg and Munich in 1984 and 1986, respectively. He also won bronze in the European Championships in 1984 in Rome.Capes represented Britain at three Olympic Games, he was sixth at Montreal 1976 and then fifth at Moscow 1980. He achieved his personal best throw of 21.68m in 1980, which stood as a British record until 2003.View image in fullscreenGeoff Capes and budgie, 1983. Photograph: Tony Evans/Timelapse Library Ltd./Getty ImagesThe British Olympic medal-winning athlete Katharine Merry posted on X that she was “so sad to hear the news that Geoff Capes passed away” and paid tribute to “a real household name”.A statement from British Athletics said: “British Athletics are saddened to hear the news of former British shot putter, Geoff Capes’ passing. Our condolences go out to his family and friends at this time.”Guinness World Records posted on X: “In 1978, Geoff threw a standard 2.27 kg (5 lb) building brick 44.54 m (146 ft 1 in) at Braybrook School in Cambridgeshire, UK. His record has never been broken.”The strongman was not limited in his pursuits by brawn and muscle as the other world title he held was the unexpected one of breeding budgerigars. He told the Guardian in 2003 of his passion for the birds.“It all began in 1969,” he related, “when I was a policeman and went to deliver a warrant for non-payment of a fine. As I knocked on the recipient’s door, I saw lots of cages in the front room, full of birds of an incredible array of colours. I was intrigued.“I went in and had a cup of tea with the owner, and spent an hour talking to him about his hobby. It was a shame that at the end of it I had to tell him I was arresting him.Quick GuideHow do I sign up for sport breaking news alerts?ShowDownload the Guardian app from the iOS App Store on iPhone or the Google Play store on Android by searching for 'The Guardian'.If you already have the Guardian app, make sure you’re on the most recent version.In the Guardian app, tap the Menu button at the bottom right, then go to Settings (the gear icon), then Notifications.Turn on sport notifications.Was this helpful?Thank you for your feedback.“But after I’d taken him down to the station and sorted out bail, he came back with a gift for me – three pairs of budgies. I went and got everything I’d need – a shed, breeding units, an aviary – and I’ve been breeding the birds ever since.”Capes was born in 1949 in Lincolnshire, the seventh of nine children. He was the seventh child of Eileen Capes, though the eldest of her three children by her third husband Bill Capes.After school, when he represented his county at basketball, football and cross country, he worked as a coalman and an agricultural labourer, before following in the footsteps of his grandfather, uncle and older brothers, he joined the police, working for ten years before representing his country at the Moscow Olympics.Explore more on these topicsAthleticsnewsShareReuse this contentMost viewedTerror attack blamed as four killed and 14 wounded at Turkish aerospace firmTuesday briefing: Canada puts India ‘on notice’ as row over alleged killing of Sikh activists escalatesLiveMiddle East crisis live: Hezbollah confirms death of prospective leader Hashem Safieddine in Israeli attackMourinho: I can win Premier League with Manchester United … if City are stripped of 2018 titleIsraelis told to urgently leave Sri Lankan tourist areas after terrorist threat",
            "fetch_timestamp": "2024-10-23T23:50:39.014710"
        }
    ]
}