{
    "metadata": {
        "scrape_timestamp": "2024-11-09T13:54:18.656286",
        "total_articles": 5,
        "version": "1.0"
    },
    "articles": [
        {
            "id": "article_1",
            "title": "Nancy Pelosi blames Joe Biden for election loss as finger pointing intensifies",
            "content": "Error fetching content: Page.evaluate: Execution context was destroyed, most likely because of a navigation",
            "source": "Nancy Pelosi blames Joe Biden for election loss as finger pointing intensifies",
            "time": "6 hours ago",
            "link": "https://news.google.com/read/CBMiXEFVX3lxTE42TmwtZlBiTmVaTXhQWXhudUFiNzFZeGJRcGNDazN5OWZqX0VYSjUyOXlwbWFwcS1udE80b2J4TWdCMU9aS3liRUNXb05WRGFaUEVFWXRGSklYUHN60gFiQVVfeXFMUDJnSEptMjQxYjZpR0R0M0NZMEhqel9jSlVnM29rS0ItU2NNZmttZlVRU0RnQmZpclptRUE1MHRfSm5ZMllDMEpEcjlMMGRHektiU1lRRm1obUlTeTdjWjA2Qmc?hl=en-GB&gl=GB&ceid=GB%3Aen",
            "fetch_timestamp": "2024-11-09T13:53:52.578791"
        },
        {
            "id": "article_2",
            "title": "Pakistan: 24 killed, over 40 injured in blast at Quetta railway station in Balochistan",
            "content": "Subscribe Now! Get features like\n\nPakistan blast: At least 24 people were killed, and more than 40 others injured after an explosion occurred at the Quetta Railway Station in Pakistan's Balochistan on Saturday. At the time of the blast, a train was ready to depart from the platform for Peshawar, reported news agency Reuters.\n\nQuetta senior superintendent of Police (SSP) operations Mohammad Baloch said the incident “seems to be a suicide blast” but it would be too early to say for sure, adding that an investigation was underway to ascertain the nature of the blast.\n\nAlso Read | Pakistan blast: Video captures moment of explosion targeting Army personnel at Quetta railway station\n\nSpeaking to reporters, SSP Baloch added that “around 100 people\" were present at the site, Dawn News reported citing footage seen by him.\n\nMohammad Baloch, a senior police officer, said the bomb exploded when passengers were waiting for a train to travel to the garrison city of Rawalpindi from Quetta, the capital of the restive Balochistan province.\n\nIn a statement, Balochistan government spokesperson Shahid Rind said police and security forces had reached the site of the incident.\n\nShahid Rind said the nature of the blast was being investigated as the Bomb Disposal Squad was collecting evidence from the site, and a report on the incident had been sought.\n\nShahid Rind said the death toll from the attack was likely to rise as some of the wounded passengers were listed in critical condition.\n\nThe government official stated that an ‘emergency’ has been imposed in the hospitals there, adding that the “injured were being provided with medical aid,” Dawn News reported.\n\nPakistan's largest and poorest province, resource-rich Balochistan is home to separatist militants.\n\nMilitants have in the past targeted energy projects with foreign financing – most notably from China – accusing outsiders of exploiting the region while excluding residents from the profits.\n\nOne of the militant groups – the Baloch Liberation Army (BLA) -- frequently claims deadly attacks against security forces or Pakistanis from other provinces, notably Punjabis.\n\nIn August, the BLA claimed responsibility for coordinated attacks by dozens of assailants who killed at least 39 people, one of the highest tolls to hit the region.",
            "source": "Pakistan: 24 killed, over 40 injured in blast at Quetta railway station in Balochistan",
            "time": "3 hours ago",
            "link": "https://news.google.com/read/CBMi2AFBVV95cUxPSHVRVEp5QV9CNHoyNU4zLU0xN3JvOHhLRm1DYlRfZ2hmSVBFWnRXXzNpdk5Jbk5kVEo1aTFrVUlEVk0wSkVzbm5HZ0dFNXBBUU5xcmVERnA5Zl9mM3lLU21hcEstNWZBS2FaMTQzdEs0ZHBXWjJ3b2xpWERoM1ByTEE4QkR1NjZGd0pyaFd5MmU3WXhKazdkV1pNUFdpTkV4RFlRMGdhMjEwVjBZTG5hNkd6OVJWUUdtVDFQd2VKYnRwN1phLTFwamhiOU9SdkhWYktCcHcxUErSAd4BQVVfeXFMT1ljTFdMM1M0NFJlZzBZdjNycG1FNElrTzYxTVFDLWpYQU5RUWQxakQwTHhER2NMRWVvcjZYWEZ3Zzd4bVd2N2ZpbTFvLTZLX0hNWFdaTnM1dktTem5KbUJ6S2M2UUFpLWF1R3k3X29ldVQydkNkMFB1Y1BNZ3F4NkMwR0ozYlBnXzlXbGJ4TmNXUHRHeWN0aGFiVEZudVRHZzB2OFdQNHNYbVlhVVQyTm5rd215T0pNZVZUbFRqc2hKYVJXT3VGc0s4cGp0VExYMDZCTTlxYkt6NnhGbkF3?hl=en-GB&gl=GB&ceid=GB%3Aen",
            "fetch_timestamp": "2024-11-09T13:53:58.544683"
        },
        {
            "id": "article_3",
            "title": "Who is Susie Wiles? Trump’s new chief of staff",
            "content": "Who is Susie Wiles? Trump’s new ‘ice maiden’ chief of staff Ms Wiles will be the first ever woman to take up the role in the White House Save Comment speech bubble icon Share icon Cameron Henderson 08 November 2024 2:44pm GMT Related Topics US Election, Donald Trump, Republicans, Florida, Ron DeSantis 08 November 2024 2:44pm GMT Save Comment speech bubble icon X Icon Facebook Icon WhatsApp Icon Donald Trump singled out Susie Wiles for praise during his election victory speech Cameron Henderson 08 November 2024 2:44pm GMT body{overflow-x: unset}#main-content{padding-top:52px}.wrp-666ec6f9-9477-4a93-832e-c2256fc33200 {margin-top: -52px;position: sticky;top: 0;z-index: 999;background: #fff;}.wrp-666ec6f9-9477-4a93-832e-c2256fc33200 iframe { height: 44px; }.wrp-666ec6f9-9477-4a93-832e-c2256fc33200::before{content: '';background: #fff;display: block;position: absolute;top: 0;left: 0;height: calc(100% + 1px); max-height: 45px;width: 100vw;transform: translateX(-50vw);left: 50%; border-bottom: 1px solid var(--Grey-B5, #B5B5B5);}@media only screen and (min-width: 800px){#main-content { padding-top: 60px; }.wrp-666ec6f9-9477-4a93-832e-c2256fc33200 { margin-top: -60px; }.wrp-666ec6f9-9477-4a93-832e-c2256fc33200 iframe {height: 52px;}.wrp-666ec6f9-9477-4a93-832e-c2256fc33200::before{max-height: 53px;}}@media only screen and (min-width: 1280px) {.key-moments--sticky {top: 61px;}}@media only screen and (min-width: 1024px) {.tpl-article__sidebar{top: 48px;}}function o(){const t=document.getElementById(\"wrp-666ec6f9-9477-4a93-832e-c2256fc33200\"),e=document.getElementById(\"main-content\");if(t&&e){const n=e.firstChild;e.insertBefore(t,n)}else console.error(\"One or both elements not found!\")}o(); When Donald Trump delivered his victory speech in West Palm Beach, among those he thanked for helping to propel him to the Presidency was a woman he called the “ice maiden”.The woman in question was Susie Wiles, the veteran Republican political adviser who has masterminded Trump’s return to power and has just been made his new chief of staff.“Susie likes to stay in the back, let me tell you. We call her the ice maiden,” the president-elect said in his Florida speech. “She is not in the background [any more].”Naming her as his new right-hand woman, President Trump said: “Susie Wiles just helped me achieve one of the greatest political victories in American history, and was an integral part of both my 2016 and 2020 successful campaigns.“Susie is tough, smart, innovative, and is universally admired and respected. “Susie will continue to work tirelessly to Make America Great Again. It is a well deserved honor to have Susie as the first-ever female Chief of Staff in United States history. I have no doubt that she will make our country proud.”The 67-year-old is among the small group of aides in Trump’s inner circle who have his ear.But unlike many of Trump’s surrogates, Ms Wiles has long-maintained a low profile. Even in her crowning moment, when the victorious Republican candidate beckoned her to the microphone, she politely declined to step forwards, leaving a reluctant Chris La Civita, her co-campaign manager, to thank her instead. Susie Wiles with fellow Trump adviser Chris LaCivita Credit: Reuters/Brian Snyder Ms Wiles is a grandmother, keen baker and birdwatcher with a hawkish political instinct.Many Republicans credit Trump’s political comeback to her bringing a new sense of discipline and direction, albeit at times transitory, to his campaign. Trump himself repeatedly referred to his advisers’ attempts to keep him on message during his stump speeches.Ms Wiles first came into Trump’s orbit in 2016 when she ran his campaign operations in the then battleground state of Florida, steering him to victory.In 2018 Trump then parachuted her in to rescue the floundering campaign of a then little-known congressman named RonDeSantis. She was also credited with helping to elect Florida senator Rick Scott in his last-minute self-funded 2019 bid, cementing her reputation as a political escape artist.Despite her success on the DeSantis campaign, Ms Wiles was unceremoniously fired by him in 2019 following a bribery scandal triggered by leaks within his operation. She was also relieved of her regional GOP duties, allegedly after the ambitious governor placed pressure on Trump.Out in the cold, Ms Wiles was facing a dead end in Florida Republican circles when Trump came calling. The former president needed someone to whip his flagging political operation into shape as his command of the GOP slipped away in the wake of Jan 6.Not only did the decision by Trump earn him the loyalty of his most trusted adviser. It also gave him the ammunition to eviscerate his one-time opponent DeSantis in the subsequent 2022 mid-terms. Susie Wiles is never far from the president-elect’s ear Credit: AP Photo/Andrew Harnik “Wiles and Trump are loyal to each other because, after DeSantis, Trump brought Susie back from the political dead,” a source told The Hill in 2022.Key to her appeal, reports claim, was that, unlike other members of Trump’s entourage who sought to leech off of him, Ms Wiles wasn’t looking to gain political capital in return.When she first accepted the job of running Trump’s campaign in the lead-up to the 2022 midterms, she asked only that her travel expenses be covered, reports suggest.“She’s purely focused on doing whatever she can for my father,” Donald Trump Jr previously said of Ms Wiles. “It’s not about making money, it’s not about getting press, it’s not about getting credit, it’s about doing everything she can to fight for my dad.”Described variously as “the most powerful Republican you don’t know” and “the most feared” political operative in America, Ms Wiles is allegedly one of few people respected enough by the president for him to listen when she disagrees with him.Bear-pit of politicsTaking up the mantle of Trump’s chief of staff will be no mean feat. Of her four predecessors, all of whom were men, one was fired via Twitter, two are now outspoken opponents of the president-elect and the final one, Mark Meadows, is still being pursued over charges relating to attempting to overturn the 2020 election.But Ms Wiles is no stranger to the male-dominated bear pit of Republican politics.Born and raised in New Jersey, Ms Wiles is the daughter of the late NFL star and broadcaster Pat Summerall. The campaign manager first cut her teeth in politics as a scheduler in Ronald Regan’s successful 1980 campaign.She went on to develop a reputation for winning in Florida as chief of staff to Jacksonville mayor John Delaney in the 90s as well as for Florida congresswoman Tillie Fowler.“I have rarely met someone with her instincts for politics and policy and where they intersect,” Mr Delaney previously said. “She knows what to magnify that will resonate with the public.”As a young aide in the Reagan administration, she experienced her first brush with scandal when her boss Raymond Donovan was investigated for alleged connections to the Florida mob.Her reputation came under further scrutiny amid allegations the former president had shown her classified documents for which he had been indicted.There is also speculation surrounding her daughter, Caroline Wiles. The younger Wiles was hired by the White House as a deputy assistant to the president and director of scheduling, despite the Washington Post noting that, with her incomplete degree, she had an “unusual background” for the senior role.Broad coalitionHaving served as CEO of Trump’s Save America PAC since March 2021, Susie Wiles has united a broad coalition of Republicans under the Trump banner in order to lead him to victory. “She has to interact with people who think [the election was stolen], and people who don’t,” political strategist Michael Caputo told CNN.Her ability as a dealmaker suggests her willingness to compromise with various factions within her party in order to bring about change.“I come from a very traditional background,” she once told Politico. “In my early career, things like manners mattered and there was an expected level of decorum. And so I get it that the GOP of today is different. There are changes we must live with in order to get done the things we’re trying to do.”Those concerned about what a second Trump term will look like may take solace in the fact that Ms Wiles is widely viewed as a moderating influence on her boss’s more capricious tendencies.“Her power with Trump is based on her ability to present him with a full range of options,” a source previously told The Hill. “Because Trump is impulsive, Wiles makes sure Trump has heard the full range of options, upsides, and downsides. She makes sure he has all the information.“When he does, Trump makes good decisions. When he doesn’t is when bad decisions are made.”Former Florida congressman Carlos Curbelo sums up the mood among many Republicans: “If Donald Trump is going to be president, I want Susie Wiles involved.”",
            "source": "Who is Susie Wiles? Trump’s new chief of staff",
            "time": "Yesterday",
            "link": "https://news.google.com/read/CBMirwFBVV95cUxQQ1JKTjFFMGdHYmpNN3dsZE1xM2pPVU4tQmVUWGZHb19oMW9YS2o4WkZsNDhRbnpsTVVfdWlsMWE5SjRMUDdhSEY1X0ZFUmFqUVMyTENLNU1CdGcwcFNXTkhQZ0tHbUNuT2I3Si15VXc0bFhLdWQ5c3hpZnViWG91SXdXdm9ZU0w5UUx4c3pGaUp2LV9ObmJMeG1zcDNEcFZTNzZfUDBpWm9KWXFGcVI4?hl=en-GB&gl=GB&ceid=GB%3Aen",
            "fetch_timestamp": "2024-11-09T13:54:04.413707"
        },
        {
            "id": "article_4",
            "title": "I thought I'd pulled a muscle - in fact it was the first sign of terminal cancer that's hitting ever more unde",
            "content": "By JONATHAN NEAL FOR MAILONLINE\n\nPublished:  10:09 GMT, 8 November 2024   |  Updated:  18:14 GMT, 8 November 2024\n\n300\n\nView  comments",
            "source": "I thought I'd pulled a muscle - in fact it was the first sign of terminal cancer that's hitting ever more unde",
            "time": "22 hours ago",
            "link": "https://news.google.com/read/CBMilgFBVV95cUxQOWgwSV8yZjFZVi1TUUJsSnpPV19vdTJaNnhNV2R5dklsWTFSUVdYaUxiMGFfSjNOR2NiOUhIMmppaWtzLVV6YlZDWnRvMjVaMG4wOUFua180X1UtQ0tlSDc4S1JiOXRMSkIxZFQ1M0MyN2RRNDB2T1oyOVVhYnBzMVFmc1VWTWs1bWxJOXBmNGJzVWtrV3fSAZsBQVVfeXFMTU1veVFOSmhaWlBnQXdiX2huMTl2Sm5USzdYc2MxS2RZZGhhZ3ZmRVBMR2ppalhGQnhFRWFEN1N0cFlVT1NUU3p1bmZONE1waTJ2LS16UDFJVm90bXJsRnpZQlJMeDRxd3JfUUxBcjlheXRnMnlqU1h6amh6eXF5V051Ry1zQ1dOcnZGSlVodjFzd1BTOGpxRWNDRDA?hl=en-GB&gl=GB&ceid=GB%3Aen",
            "fetch_timestamp": "2024-11-09T13:54:10.423791"
        },
        {
            "id": "article_5",
            "title": "British supermodel Georgina Cooper dies aged 46 as devastated celebrities pay tribute to ‘unforgettable’ st...",
            "content": "Karim CamaraPublished: Invalid Date, A BRITISH supermodel, who rose to fame during the days of Cool Britannia in the nineties, has sadly passed away aged 46.Georgina Cooper's friends have shared heartfelt tributes on social media after news broke of the model's death.4Georgina Cooper has tragically passed away aged 46Credit: Getty4She rose to fame during the days of Cool Brittania in the ninetiesCredit: Getty4Models from across the industry shared tributes to Georgina on social mediaCredit: GettyModel Jade Parfitt posted a series of photos paying tribute to Georgina on Instagram with a heart caption.She wrote: \"Goodbye beautiful girl.\"Devastated to share the news of George’s passing. One of the funniest and naughtiest, never mind most beautiful friends, we all wanted to hang out with George backstage.\"Sending so much love to her son, family and friends. Gone too soon.\"read more on showbizEvery cloud Underground electronic music maestro Silverlining on his new albumBATTLE READY I got pumped during Gladiator II but I was banned from stunt says Paul MescalModels from across the industry joined Jade in sharing tributes to Georgina.Erin O'Connor commented: \"Ahh George…. You were an incredibly loving and kind human being. !We all admired and loved you so much for the warmth and generosity you brought to us all. \"Beautiful soul, Mum, woman. Rest in peace.\"Most read in ShowbizSAD STARPop star reveals heartbreak after she has to cancel concert over safety fearsTRAGIC LOSSSupermodel Georgina Cooper dies aged 46 after 'suddenly falling ill' abroadBGT SHAKE UPMajor change to BGT revealed - and bosses hope it will make show 'electric'new heights6ft tall Hollywood nepo baby daughter towers over her famous mumThe British supermodel rose to stardom during the days of Cool Britannia in the nineties.Georgina, born in London, graced the covers of leading fashion magazines like The Face and appeared in the pages of American Vogue.The supermodel's career began in 1992 when, at just 13, her mum entered her in the Elite Look of the Year contest.However, she quickly climbed the modelling ranks and thrived during the Cool Britannia era in the nineties.Georgina described the period as being \"very cool as it was very much about being yourself\" in an interview.In a 2018 interview with Cultural Omnivore, the 46-year-old revealed that becoming a mum led her to step back from modelling and pursue a career in hospitality.She added: \"I work in the hospitality industry, and I love it because I’m a people person.\"After I had my son I just couldn’t bear to leave him alone and I wanted to be there for him. \"I tried to continue modelling but it broke my heart when I had to leave him for work.\"4Georgina Cooper appeared in the pages of American VogueCredit: GettyTopicsCelebrity deathsFacebookInfluencersInstagramSocial MediaTwitterGeorgina RodriguezLondonYOU MIGHT LIKE",
            "source": "British supermodel Georgina Cooper dies aged 46 as devastated celebrities pay tribute to ‘unforgettable’ st...",
            "time": "17 hours ago",
            "link": "https://news.google.com/read/CBMikAFBVV95cUxOT2RudTlxQTljRU1TakFNQ1dTNEozTjVlNlQ3dnc5eG1heEpieFd2XzF2Zzg2MWxyR1pwQ2lvNzl2WjczQ01EaFNLU3ZXY0pFUTR2b1pUd3lEZUJzWkVtMEROcll4S1o4TXdZM1FyZzA5RkRvXzNqUkhDUHRWVnBDY0xYc1d2Q24wb0VJNUFmMUXSAZYBQVVfeXFMUHhPektXYnVlTHdTUzhWdWZMcFBmN2dpQjViRHF2NER6UWJZNGM4NVJ5SVRMSE11eFRKYjl5dGJDRUZhYlh2d0xiN2V5VW1rSUVCWG1ZcWRFcmxiVzFwVTR5dHVYUy04czA3clBYOGxhblF4SzlLdW1Ya0ZIcHRBREZUTHh1MF8tZnRPbHgyallBaHRpTmpB?hl=en-GB&gl=GB&ceid=GB%3Aen",
            "fetch_timestamp": "2024-11-09T13:54:16.503980"
        }
    ]
}