[
    {
        "_id": "67343b01784d29bdedd5e8f8",
        "text": "Former aide Sue Gray rejects Keir Starmer’s job offerNumber 10 indicated it was unlikely the role would be offered to someone else, saying there were “no plans” for further updates on the matter.Gray stepped down as Starmer’s chief of staff last month after conceding that her position risked becoming a “distraction to the government’s vital work of change”.Her £170,000-a-year salary had been leaked to the media amid intrigue surrounding her position in Downing Street, and stoked unease for being higher than Starmer’s and because other advisers believed they had been underpaid.Some Number 10 officials denied that she was involved in special adviser contracts and insisted her role as chief of staff had made her a lightning rod for any grievances at the centre of government.She was replaced by Starmer’s strategy guru Morgan McSweeney, with whom she was said to have been locked in a territorial tussle. He was viewed as being at the heart of a clique that Gray’s allies regarded as a “boys’ club”.Tim Bale, politics professor at Queen Mary University of London, said he was unsurprised by her decision to turn down the envoy role.RecommendedPerson in the NewsSue Gray, the formidable official investigating a very British scandal “It’s not as if someone with her varied experience and particular skillset won’t have other opportunities,” he said.Bale added that Starmer and his team would be hoping that Gray’s move was not “a prelude to her talking too publicly about some of what went on in Number 10 before she was replaced”.The Conservatives leapt on the development, with Tory MP Richard Holden describing it as “a major embarrassment” for Starmer and “a sign of the dysfunction at the heart of his administration”."
    },
    {
        "_id": "67343b01784d29bdedd5e8f9",
        "text": "People rushed to hospital after car ploughs into busy street in central LondonTwo people – a pedestrian and a passenger who was in the car – were taken to hospital for treatment.’ More Trending Girl, 17, killed in horror crash on M5 after jumping out of police car British woman accused of £15,000,000 cocaine plot 'thought she was carrying cash' Map shows full list of WHSmith stores closing down in 2024 Someone has won £2,630,000 on the Lottery and doesn't even know it Read More StoriesThe driver was not seriously injured, but was taken to hospital as well, police said. One X user wrote: ‘Can’t park there, mate.’ Get in touch with our news team by emailing us at webnews@metro.co.uk."
    },
    {
        "_id": "67343b01784d29bdedd5e8fb",
        "text": "Prince Harry's eight-word response when King Charles 'banned' Meghan Markle from BalmoralPrince Harry's eight-word response when King Charles 'banned' Meghan Markle from BalmoralPrince Harry was reportedly angry after he was told his wife Meghan Markle could not come with him to Balmoral on the day of the late Queen's death. \"The duke said he felt furious and told his father: \"Don't ever speak about my wife that way.\""
    },
    {
        "_id": "67343b01784d29bdedd5e8f7",
        "text": "League tables to reveal failing NHS trusts\"We will drive the health service to improve, so patients get more out of it for what taxpayers put in,\" he will say.“Our health service must attract top talent, be far more transparent to the public who pay for it, and run as efficiently as global businesses.\" \"We hope trusts who receive greater funding freedom will use this money wisely - to cut waiting times, make the waiting experience better for patients, and strengthen the ways they work with patients to improve services,\" she said."
    },
    {
        "_id": "67343b01784d29bdedd5e8fa",
        "text": "Fresh row at BBC as host Mark Chapman refuses to share MOTD job with female star after Gary Lineker quit...A source said: “As soon as Gary’s deal was done, Alex made it clear he wanted Mark and Kelly to replace him.“It would effectively be a job share and they would rotate hosting duties between them.“Mark has made it clear within the team at MOTD that this isn’t something he would want to do.Most read in FootballMORE PAINHeartache for George Baldock's family over defender's official cause of deathMAN UPMan Utd star Garnacho told 'football isn't for you' after non-celebrationI AD THE LOTI'm football's biggest waste - I abandoned stadium glory to drink to oblivionPIERS MORGANMy pal Gary Lineker wasn't happy when I said he's even more divisive than ME“He doesn’t want a job share, he wants Gary’s role as his own, which is understandable.“It’s a headache for the BBC because they thought they’d found an easy solution.Gary Lineker will stop presenting Match of the Day the end of this season at and will quit Beeb by 2027“It’s back to the drawing board and negotiations are ongoing.”BBC Sport reporter Somers is in the frame after winning fans with her Euros coverage this summer. Insiders said he wanted a multi-year contract and offered to take a pay cut.However, after weeks of tense negotiations, the BBC agreed only to extend his MOTD deal to the end of this season.It is understood his new contract pays at least £500,000 less.Lineker will continue to host the MOTD Top Ten podcast and The Rest is Football — part of his own stable of podcasts — will now be available on BBC Sounds.READ MORE SUN STORIESNO MAUR!"
    }
]